In [1]:
%load_ext autoreload
%autoreload 2

In [2]:
from helpers.gcs_funcs import list_blobs, list_blobs_pd

In [3]:
BUCKET_NAME = "XXX"
FULL_BUCKET_NAME = "gs://" + BUCKET_NAME 
FOLDER_NAME = "CEFR"

In [4]:
files_df = list_blobs_pd(bucket_name=BUCKET_NAME, 
           folder_name=FOLDER_NAME)
file_names = list(files_df.iloc[1:]["Name"])

In [5]:
file_names

['CEFR/CEFR_kaggle.csv',
 'CEFR/NewsInLevels_dataset.csv',
 'CEFR/OneStopEnglishCorpus_Dataset.csv',
 'CEFR/book_levels.csv']

In [6]:
import pandas as pd
import numpy as np

In [7]:
df1 = pd.read_csv(FULL_BUCKET_NAME + "/CEFR/CEFR_kaggle.csv")
df2 = pd.read_csv(FULL_BUCKET_NAME + "/CEFR/NewsInLevels_dataset.csv")
df3 = pd.read_csv(FULL_BUCKET_NAME + "/CEFR/OneStopEnglishCorpus_Dataset.csv")

### CEFR Kaggle Dataset

In [8]:
df1.head()

                                                text label
0  Hi!\nI've been meaning to write for ages and f...    B2
1  ﻿It was not so much how hard people found the ...    B2
2  Keith recently came back from a trip to Chicag...    B2
3  The Griffith Observatory is a planetarium, and...    B2
4  -LRB- The Hollywood Reporter -RRB- It's offici...    B2

In [9]:
df1.label.value_counts()

A1    288
B2    286
A2    272
C1    241
B1    205
C2    202
Name: label, dtype: int64

In [10]:
df1.shape

(1494, 2)

In [11]:
# Mapping dictionary
mapping = {'A': 1, 'B': 2, 'C': 3}

# Update the DataFrame column
df1['label'] = df1['label'].str[0].map(mapping)

print(df1)

                                                   text  label
0     Hi!\nI've been meaning to write for ages and f...      2
1     ﻿It was not so much how hard people found the ...      2
2     Keith recently came back from a trip to Chicag...      2
3     The Griffith Observatory is a planetarium, and...      2
4     -LRB- The Hollywood Reporter -RRB- It's offici...      2
...                                                 ...    ...
1489  Light propagating in the vicinity of astrophys...      3
1490  Future of dentistry has become one of the most...      3
1491  ﻿The forests – and suburbs – of Europe are ech...      3
1492  Hedge funds are turning bullish on oil once ag...      3
1493  Without additional heating, radiative cooling ...      3

[1494 rows x 2 columns]

In [12]:
df1.label.value_counts()

1    560
2    491
3    443
Name: label, dtype: int64

### NewsInLevels Dataset

In [13]:
df2.head()

,level_url,level,text
0,https:www.newsinlevels.comproductsscientists-i...,1,Scientists at a research station in Norway are...
1,https:www.newsinlevels.comproductsscientists-i...,2,Scientists who are researching the Arctic regi...
2,https:www.newsinlevels.comproductsscientists-i...,3,Scientists studying the Arctic region from the...
3,https:www.newsinlevels.comproductseasy-speakin...,1,"Hello students, There is a website for you. It..."
4,https:www.newsinlevels.comproductseasy-speakin...,2,"Hello students,\nWe have a website for you. It..."

In [14]:
df2.level.value_counts()

1    3700
3    3699
2    3698
Name: level, dtype: int64

In [15]:
df2.shape

(11097, 3)

In [16]:
df2.rename(columns={"level": "label"}, inplace=True)

In [17]:
df2 = df2[["text", "label"]]

In [18]:
df2.head()

                                                text  label
0  Scientists at a research station in Norway are...      1
1  Scientists who are researching the Arctic regi...      2
2  Scientists studying the Arctic region from the...      3
3  Hello students, There is a website for you. It...      1
4  Hello students,\nWe have a website for you. It...      2

### OneStopEnglishCorpus Dataset

In [19]:
df3.head()

,url,text,level
0,/nishkalavallabhi/OneStopEnglishCorpus/blob/ma...,"﻿When you see the word Amazon, what’s the firs...",Elementary
1,/nishkalavallabhi/OneStopEnglishCorpus/blob/ma...,"﻿To tourists, Amsterdam still seems very liber...",Elementary
2,/nishkalavallabhi/OneStopEnglishCorpus/blob/ma...,"﻿Anitta, a music star from Brazil, has million...",Elementary
3,/nishkalavallabhi/OneStopEnglishCorpus/blob/ma...,Google has made maps of the world’s highest mo...,Elementary
4,/nishkalavallabhi/OneStopEnglishCorpus/blob/ma...,﻿The auction of a Banksy painting that disappe...,Elementary

In [20]:
df3.level.value_counts()

Elementary      189
Intermediate    189
Advanced        189
Name: level, dtype: int64

In [21]:
df3.shape

(567, 3)

In [22]:
df3.rename(columns={"level": "label"}, inplace=True)

In [23]:
df3 = df3[["text", "label"]]

In [24]:
# Mapping dictionary
mapping = {'Elementary': 1, 'Intermediate': 2, 'Advanced': 3}

# Update the DataFrame column
df3['label'] = df3['label'].map(mapping)

print(df3)

                                                  text  label
0    ﻿When you see the word Amazon, what’s the firs...      1
1    ﻿To tourists, Amsterdam still seems very liber...      1
2    ﻿Anitta, a music star from Brazil, has million...      1
3    Google has made maps of the world’s highest mo...      1
4    ﻿The auction of a Banksy painting that disappe...      1
..                                                 ...    ...
562  ﻿In typical bad-boyfriend style, Dan Sullivan ...      3
563  ﻿Thousands of people protested on Australia’s ...      3
564  ﻿1 Race engineer  A race engineer liaises betw...      3
565  ﻿More than one million British workers might b...      3
566  ﻿Low-income countries will remain on the front...      3

[567 rows x 2 columns]

### Combining the data

In [25]:
X = pd.concat([df1, df2, df3])
X.reset_index(drop=True, inplace=True)
y = X["label"]
X.drop(columns=["label"], inplace=True)

In [26]:
X

                                                    text
0      Hi!\nI've been meaning to write for ages and f...
1      ﻿It was not so much how hard people found the ...
2      Keith recently came back from a trip to Chicag...
3      The Griffith Observatory is a planetarium, and...
4      -LRB- The Hollywood Reporter -RRB- It's offici...
...                                                  ...
13153  ﻿In typical bad-boyfriend style, Dan Sullivan ...
13154  ﻿Thousands of people protested on Australia’s ...
13155  ﻿1 Race engineer  A race engineer liaises betw...
13156  ﻿More than one million British workers might b...
13157  ﻿Low-income countries will remain on the front...

[13158 rows x 1 columns]

In [27]:
y.value_counts()

1    4449
2    4378
3    4331
Name: label, dtype: int64

### Preprocessing

In [28]:
import nltk
nltk.download('wordnet')

[nltk_data] Downloading package wordnet to /home/jupyter/nltk_data...
[nltk_data]   Package wordnet is already up-to-date!

True

In [33]:
%reload_ext autoreload

[nltk_data] Downloading package stopwords to
[nltk_data]     /home/jupyter/nltk_data...
[nltk_data]   Package stopwords is already up-to-date!

In [30]:
from helpers.data_preparation import preprocessing_pipeline

[nltk_data] Downloading package stopwords to
[nltk_data]     /home/jupyter/nltk_data...
[nltk_data]   Package stopwords is already up-to-date!

In [34]:
print('Preprocessing the data...')
preprocessor = preprocessing_pipeline()
X = preprocessor.fit_transform(X)

Preprocessing the data...
Preprocessing completed.

In [35]:
X

                                                    text
0      hi ive meaning write age finally today im actu...
1      much hard people found challenge far would go ...
2      keith recently came back trip chicago illinois...
3      griffith observatory planetarium exhibit hall ...
4      lrb hollywood reporter rrb official amcs walki...
...                                                  ...
13153  typical badboyfriend style dan sullivan late b...
13154  thousand people protested australia beach shar...
13155  1 race engineer race engineer liaises driver m...
13156  one million british worker might employed zero...
13157  lowincome country remain front line humaninduc...

[13158 rows x 1 columns]